app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%articulo%')
---
  def index
    filtro=params[:search]
    if filtro.nil?
      @todosPost=Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @mostrarPost=Post.find_by_id(params[:id])

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hola"], ["content", "hola1"], ["created_at", "2016-04-27 22:04:30.017891"], ["updated_at", "2016-04-27 22:04:30.017891"]]
---
  def create
    nuevoPost= Post.new(params.require(:post).permit(:title,:content,:reviewDate))
    #Guarda en la BD
    nuevoPost.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @editPost= Post.find_by_id(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", ""], ["content", ""], ["updated_at", "2016-05-23 00:13:13.266421"], ["id", 1]]
---
  def update
    @editPost=Post.find_by_id(params[:id])
    @editPost.update(params.require(:post).permit(:title,:content))